// creating an array and passing the number, questions, options, and answers
let questions = [ {
    numb: 1,
    question: "पर्वतस्याञ्चले एकः ______ जलाशयः आसीत् |",
    answer: "विशालः",
    options: [
      "जलचराः",
      "जलं",
      "विशालः",
      "अल्प"
    ]
  },
  {
    numb: 2,
    question: "अस्मिन् दीर्घकाले जलं विना सरोवरः _____ भविष्यति |",
    answer: "शुष्कः",
    options: [
      "शुष्कः",
      "शाठयाम् ",
      "र्देवञाः",
      "समाप्त"
    ]
  },
  {
    numb: 3,
    question: "______ बकस्य ग्रीवा धृत्वातेन सह आकरामार्गेन |",
    answer: "कुलीरकः",
    options: [
      "न्यग्रोधः",
      "वकोजपि",
      "कुलीरकः",
      "जलचराः"
    ]
  },
  {
    numb: 4,
    question: "पर्वतस्याञ्चले एकः विशालः कः आसीत्?",
    answer: "जलाशयः",
    options: [
      "जलाशयः",
      "जन्तुशालाः",
      "विद्यालयाः",
      "नदी"
    ]
  },
  {
    numb: 5,
    question: "तस्मिन् जलाशये बहवः केषु सुखेन वसन्ति स्म?",
    answer: "जलचराः",
    options: [
      "मृगाः",
      "जलचराः",
      "मीनाः",
      "बकः"
    ]
  },
  {
    numb: 6,
    question: "न्यग्रोधवृक्षे एकः वृद्धः कः वसति?",
    answer: "बकः",
    options: [
      "मत्स्याः",
      "कुलीरकः",
      "बकः",
      "मकरः"
    ]
  },

  {
    numb: 7,
    question: "एकः ___ समीपं गत्वा तम् अपृच्छत्।",
    answer: "कुलीरक:",
    options: [
      "कुलीरक:",
      "मत्स्याः",
      "दैवज्ञाः",
      "बकः"
    ]
  },

  {
    numb: 8,
    question: "बकः जलचरं ____ नेष्यति।",
    answer: "आकाशमार्गेन",
    options: [
      "जमीनमार्गैन",
      "जलमार्गेन",
      "आकाशमार्गेन",
      "अन्तरिक्षमार्गेन"
    ]
  },

  {
    numb: 9,
    question: "_____ बकस्य कोमलाम् गीवाम् छिन्नाम् अकरोत्।",
    answer: "कुलीरकः",
    options: [
      "मत्स्यः",
      "दैवज्ञाः",
      "कुलीरकः",
      "मकरः"
    ]
  },

  {
    numb: 10,
    question: "जलचरानाम् नाशस्य विषये चिन्तयित्वा ___ दुःखितः अस्ति।",
    answer: "बकः",
    options: [
      "मत्स्याः",
      "दैवज्ञाः",
      "बकः",
      "कुलीरक:"
    ]
  },

  {
    numb: 11,
    question: "सर्वे जलचराः कः अवदन्?",
    answer: "शठे शाठ्यं समाचरोत्",
    options: [
      "शठे शाठ्यं सचरोत्",
      "शठे शाठ्यं समाचरोत्",
      "शठे शाठ्यं सामचरोत्",
      "शठे शठ्यं समाचरोत्"
    ]
  },

  {
    numb: 12,
    question: "सर्वे जलचराः कः अवदन्?",
    answer: "",
    options: [
      "वार्ता करणे",
      "चञ्चलमत्स्यानाम्",
      "उत्पतितुम्",
      "मत्स्यानां वधे"
    ]
  },
  {
    numb: 13,
    question: "संधिं कुरुत - न + अतिदूरम् ?",
    answer: "नातिदुरम्",
    options: [
      "नतिदुरम्",
      "नातिदूरम्",
      "नातिदुरम्",
      "नतिदूरं"
    ]
  },

  {
    numb: 14,
    question: "जलाशयस्य तटे कः स्थितः आसीत् ?",
    answer: "वृक्षः",
    options: [
      "कुलीरकः",
      "बकः",
      "जलचराः",
      "वृक्षः"
    ]
  },

  {
    numb: 15,
    question: "सः मत्स्यान् कुत्र स्थाप्य अभक्षयत् ?",
    answer: "शिलयाम्",
    options: [
      "वृद्धः",
      "शिलयाम्",
      "चञ्चलमत्स्यानाम्",
      "पर्वतस्याञ्चले"
    ]
  },


  {
    numb: 16,
    question: "तत्रैव न्यग्रोधवृक्षे एकः कः बकोऽपि वसति स्म ?",
    answer: "वृद्धः",
    options: [
      "वृद्धः",
      "वृद्धावस्था",
      "समीपं",
      "वृद्धः"
    ]
  },

  {
    numb: 17,
    question: "तत्रैव न्यग्रोधवृक्षे एकः कः बकोऽपि वसति स्म ?",
    answer: "वृद्धः",
    options: [
      "वृद्धः",
      "वृद्धावस्था",
      "समीपं",
      "वृद्धः"
    ]
  },

  {
    numb: 18,
    question: "सः जलाशयस्य तीरे __ कृर्वत् अतिष्ठत् |",
    answer: "अश्रुपातं",
    options: [
      "दृष्ट्वा",
      "अश्रुपातं",
      "वृद्धावस्था",
      "बकस्य"
    ]
  },

  {
    numb: 19,
    question: "एतत् दृुष्टवा जलचराः __ अभवन् परं को गपि तस्य समीप ते गच्छति स्म |",
    answer: "आश्चर्यचकिता",
    options: [
      "आश्चर्यचकिता",
      "वृद्धः",
      "सुखेन",
      "दुःखस्य"
    ]
  },

  {
    numb: 20,
    question: "नातिदूर शिलायाः उपरि कुलीरकः __ अपश्यत्|",
    answer: "मत्स्य कंटकानि",
    options: [
      "मत्स्य कंटकानि",
      "मत्स्य कटकानि",
      "मत्स्य काटकनि",
      "मत्स्य कान्तकानि"
    ]
  }


  // you can uncomment the below codes and make duplicate as more as you want to add question
  // but remember you need to give the numb value serialize like 1,2,3,5,6,7,8,9.....

  //   {
  //   numb: 6,
  //   question: "Your Question is Here",
  //   answer: "Correct answer of the question is here",
  //   options: [
  //     "Option 1",
  //     "option 2",
  //     "option 3",
  //     "option 4"
  //   ]
  // },
];